requestfreerooms.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getFreeRoomsRequest>
            <gs:startDate>2025-05-08</gs:startDate>
            <gs:endDate>2025-05-13</gs:endDate>
        </gs:getFreeRoomsRequest>
    </soapenv:Body>
</soapenv:Envelope>